pub const WEAPON_NAMES: [&str; 8] = [
    "なし",
    "たけざお",
    "こんぼう",
    "どうのつるぎ",
    "てつのおの",
    "はがねのつるぎ",
    "ほのおのつるぎ",
    "ロトのつるぎ",
];

pub const ARMOR_NAMES: [&str; 8] = [
    "なし",
    "ぬののふく",
    "かわのふく",
    "くさりかたびら",
    "てつのよろい",
    "はがねのよろい",
    "まほうのよろい",
    "ロトのよろい",
];

pub const SHIELD_NAMES: [&str; 4] = ["なし", "かわのたて", "てつのたて", "みかがみのたて"];

pub const ITEM_NAMES: [&str; 15] = [
    "なし",
    "たいまつ",
    "せいすい",
    "キメラのつばさ",
    "りゅうのうろこ",
    "ようせいのふえ",
    "せんしのゆびわ",
    "ロトのしるし",
    "おうじょのあい",
    "のろいのベルト",
    "ぎんのたてごと",
    "しのくびかざり",
    "たいようのいし",
    "あまぐものつえ",
    "にじのしずく",
];
