pub const NAME_MAX_LENGTH: usize = 4;
pub const KANA_TABLE: [char; 64] = [
    '０','１','２','３','４','５','６','７','８','９','あ','い','う','え','お','か',
    'き','く','け','こ','さ','し','す','せ','そ','た','ち','つ','て','と','な','に',
    'ぬ','ね','の','は','ひ','ふ','へ','ほ','ま','み','む','め','も','や','ゆ','よ',
    'ら','り','る','れ','ろ','わ','を','ん','っ','ゃ','ゅ','ょ','゛','゜','－','　',
];

pub const DAKUTEN_PAIRS: &[(char, char)] = &[
    ('が', 'か'), ('ぎ', 'き'), ('ぐ', 'く'), ('げ', 'け'), ('ご', 'こ'),
    ('ざ', 'さ'), ('じ', 'し'), ('ず', 'す'), ('ぜ', 'せ'), ('ぞ', 'そ'),
    ('だ', 'た'), ('ぢ', 'ち'), ('づ', 'つ'), ('で', 'て'), ('ど', 'と'),
    ('ば', 'は'), ('び', 'ひ'), ('ぶ', 'ふ'), ('べ', 'へ'), ('ぼ', 'ほ'),
];

pub const HANDAKUTEN_PAIRS: &[(char, char)] = &[
    ('ぱ', 'は'), ('ぴ', 'ひ'), ('ぷ', 'ふ'), ('ぺ', 'へ'), ('ぽ', 'ほ'),
];